snlkuharlocal/src/Documents/ЗаказКлиентаFBS/ЗаказКлиентаFBS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиентаFBS</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛистПереукладки</name>
      <type>
        <types>DocumentRef.ЛистПереукладки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрефиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуффиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РИД</name>
      <comment>идентификатор вайлдб. для обмена.</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусWB</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаказа</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеУКлиента</name>
      <type>
        <types>CatalogRef.СостояниеНакладнойУКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>АртикулКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтменаОтработана</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрэкНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛогистСервис</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВычеркОфис</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВычеркСклад</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПереданоНаСайт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/CommonModules/ОбменМаркетПлейсПИ/Module.bsl
/////////////////////////////////////////////////////////////////////////////////
// Дублирующие серверные процедуры повторного использования для работы
// в модели сервиса:
// - для работы с API маркетплейсов;
// - базовый функционал для вызова REST API;
// - Для обработки документов и сущности принадлежащим внешним системам;
// - прочее.
/////////////////////////////////////////////////////////////////////////////////
// Тимофеев Ю.А. - правки в ЭТОТ МОДУЛЬ вносить СТРОГО по согласованию со мной //
// Версия 1.1.00001 от 30.04.2026 Ихсанов Д.А.                                 //
//                                                                             //
//                                        ...                                  //
//                                   ...  .++:                                 //
//                                   .+*-..+#-=.                               //
//                                   .:=.:=+=*==.                              //
//                                   .:+.......-*..                            //
//                                 ..-=*+.--#:*--%.                            //
//                                --.. -=#*+%+=**=#.                           //
//                               .=-::......*..::*#+.                          //
//                               .-++=**....     .%%:.                         //
//                                 .:-:-+*#-   .::+@=.                         //
//                                       .**.  .=@%%%.                         //
//                                       :#@: ..+@%=%:                         //
//                                       :##:  .#@-.#+.                        //
//                     .............     :@%.   :%:.*@.                        //
//                .:+**+===++++++#%%#**=:#=..   .#..+@.                        //
//             .=%*:...:---=+#@@@@%%%*=--+..     =. =@.                        //
//           .:@+.          .-+.-@@@%@@-.        :. =@.                        //
//          .#%:.                                .. =@.                        //
//         .*%.#                                    +@.                        //
//        .=@-@+                                  ..*@.                        //
//        .+#+@-                                 ::+#@.                        //
//        .#+#@.                                .*@%@*.                        //
//        .#+%@.     ..                  ...:...=@@*%-.                        //
//        .*+#*.     ...                 ..*%:*-##:+@.                         //
//        .=+-..     .=-.                ....*#*-..+#.                         //
//        .-+.       ::@*-: .:.                ...:@=.                         //
//         .=-.       =*@##::-+=:.             ...=%:.                         //
//         .-@=:      .%@@@@*=-@*#:.          .-##@*.                          //
//          .#%=       :@@@@@@-.....          .=-%%-.                          //
//           =@:.      :@@@@@@@+:-=.           .=@#.                           //
//           :@%-      :@%%*%@@@%@@=          .-@@:                            //
//           .#%:   ...-#:....:.-=-%.     .. .-%@=.                            //
//           .:%:  .:*:@*.         -*    .:..:@+..                             //
//       .    .*.  .-@@@:          .@.   ....##-                               //
//    .  =.   :#.  .=@%#   .       .@.   :+..%..                               //
//... =. :@: .##:. .=@:.   .-.. ....@.:. -%-*-                                 //
//.+-.#*::@%:++==-+.=#.:-...%=-.:*+*#-#+.%%:%. ..               COLLANT        //
//.+@:@@+%@@%@@++*@@#@+:#:%.@%%@:@@@-*@%@@@@%@#**-.... .. . .. .. .. . .       //
//.+@@@@@@@@@@@@@@@@@@@*@@@@@@@@@@@@@@@@@@@@@@@@@@@#=#--+:+:.:+@@@@@@=#--+:    //
//.+@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@#%%@*.  //
//.-+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++=.//
/////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область Маркетплейсы_ОбщиеМетоды

#Область Маркетплейсы_БазовыйФункционал // ЛЕГАСИ - На замену HTTP коннектор!!!

// Получить общие параметры обработки.
// Ихсанов Д. А. 11.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2085
// 
// Возвращаемое значение:
//  Структура - Получить общие параметры обработки:
// * ИменаПолейСДатами - Неопределено - 
// * ИменаПолейДляВосстановления - Неопределено - 
// * ПараметрыЗапроса - Структура - 
// * ДанныеЗапроса - Структура - 
// * ИменаСвойствОшибок - Строка - 
// * ЗначенияСвойствОшибок - Строка - 
Функция ПолучитьОбщиеПараметрыОбработки() Экспорт
	
	Возврат ОбменМаркетПлейс.ПолучитьОбщиеПараметрыОбработки();
	
КонецФункции // ПолучитьОбщиеПараметрыОбработки()

#КонецОбласти

// Текст запроса данные заказов модели сервиса.
// 
// Параметры:
//  ИмяТаблицыЗаказов - Строка - Имя таблицы заказов
//  ИмяТаблицыТоваров - Строка - Имя таблицы товаров
// 
// Возвращаемое значение:
//  Строка - Текст запроса данные заказов модели сервиса
Функция ТекстЗапросаДанныеЗаказовМоделиСервиса(ИмяТаблицыЗаказов, ИмяТаблицыТоваров) Экспорт 
	
	Возврат ОбменМаркетПлейс.ТекстЗапросаДанныеЗаказовМоделиСервиса(ИмяТаблицыЗаказов, ИмяТаблицыТоваров);
	
КонецФункции // ТекстЗапросаДанныеЗаказовМоделиСервиса()

// Функция - Получить интернет магазин
// 
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - Ссылка на контрагент, по которому вернется ссылка на интернет магазин
// 
// Возвращаемое значение:
//  СправочникСсылка.ИнетМагазины - Ссылка на сущность маркетплейса
Функция ПолучитьИнтернетМагазин(Контрагент) Экспорт
	
	Запрос=новый запрос;
	Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИнетМагазины.Ссылка КАК ИМ
	|ИЗ
	|	Справочник.ИнетМагазины КАК ИнетМагазины
	|ГДЕ
	|	ИнетМагазины.Контрагент = &Контрагент
	|	И НЕ ИнетМагазины.ПометкаУдаления";
	запрос.УстановитьПараметр("Контрагент",Контрагент);
	Выборка = запрос.Выполнить().Выбрать();
	пока выборка.Следующий() цикл
		возврат Выборка.ИМ;
	КонецЦикла;
	
	Возврат Справочники.ИнетМагазины.ПустаяСсылка();
	
КонецФункции // ПолучитьИнтернетМагазин()

// Заполнить данные маркет плейса по контрагенту.
// Ихсанов Д. А. 01.09.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2482
// 
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - Контрагент
//  ПунктДоставки - СправочникСсылка.ПунктыДоставки - Пункт доставки
// 
// Возвращаемое значение:
//  Структура - Заполнить данные маркет плейса по контрагенту
Функция ЗаполнитьДанныеМаркетПлейсаПоКонтрагенту(Контрагент, ПунктДоставки) Экспорт
	
	Возврат ОбменМаркетПлейс.ЗаполнитьДанныеМаркетПлейсаПоКонтрагенту(Контрагент, ПунктДоставки);
	
КонецФункции // ЗаполнитьДанныеМаркетПлейсаПоКонтрагенту()

// Контрагент участник маркет плейса.
// Ихсанов Д. А. 01.09.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2482
// 
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - Контрагент
//  ПунктДоставки - СправочникСсылка.ПунктыДоставки - Пункт доставки
// 
// Возвращаемое значение:
//  Булево - Контрагент участник маркет плейса
Функция КонтрагентУчастникМаркетПлейса(Контрагент, ПунктДоставки) Экспорт
	
	Возврат ОбменМаркетПлейс.КонтрагентУчастникМаркетПлейса(Контрагент, ПунктДоставки);
	
КонецФункции // КонтрагентУчастникМаркетПлейса()

// Получить количество заказов в накладной.
// Кухарь А.Ю. 22.05.2022
// 
// Параметры:
//  Накладная - ДокументСсылка.РасходнаяНакладная - Документ накладная
// 
// Возвращаемое значение:
//  Число - Получить количество заказов в накладной
Функция ПолучитьКоличествоЗаказовВНакладной(Накладная) Экспорт
	  
	  Запрос = новый запрос;
	  запрос.Текст="ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаFBSТовары.НомерЗаказа) КАК КоличествоЗаказов
	               |ИЗ
	               |	Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBSТовары
	               |ГДЕ
	               |	ЗаказКлиентаFBSТовары.Ссылка.ДокОснование = &Накладная
	               |	И ЗаказКлиентаFBSТовары.Ссылка.Дата > &Дата
	               |	И не ЗаказКлиентаFBSТовары.Отменен";
	 запрос.УстановитьПараметр("Накладная",Накладная);
	 запрос.УстановитьПараметр("Дата",Константы.ДатаЗапретаРедактирования.Получить());	 
	 Результат=запрос.Выполнить().Выбрать();
	 пока результат.Следующий() цикл
		 если результат.НомерЗаказа<>null тогда
			 возврат результат.КоличествоЗаказов;
		 КонецЕсли;
	 КонецЦикла;
	 возврат 0;
	 
КонецФункции // ПолучитьКоличествоЗаказовВНакладной()

// Получить количество заказов ВЛН.
// Кухарь А.Ю. 22.05.2022
// 
// Параметры:
//  ЛистНабора - ДокументСсылка.ЛистНабора -  Лист набора
// 
// Возвращаемое значение:
//  Число - Получить количество заказов ВЛН
Функция ПолучитьКоличествоЗаказовВЛН(ЛистНабора) Экспорт
	Запрос = новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛистПереукладки.НомерЗаказа) КАК КоличествоЗаказов
	|ИЗ
	|	Документ.ЛистПереукладки КАК ЛистПереукладки
	|ГДЕ
	|	ЛистПереукладки.Проведен
	|	И ЛистПереукладки.Дата >= &Дата
	|	И ЛистПереукладки.ЛистНабора = &ЛистНабора";
	 запрос.УстановитьПараметр("ЛистНабора",ЛистНабора);
	 запрос.УстановитьПараметр("Дата",Константы.ДатаЗапретаРедактирования.Получить());	 
	 Результат=запрос.Выполнить().Выбрать();
	 пока результат.Следующий() цикл
		 если результат.НомерЗаказа<>null тогда
			 возврат результат.КоличествоЗаказов;
		 КонецЕсли;
	 КонецЦикла;
	 возврат 0;
	
 КонецФункции // ПолучитьКоличествоЗаказовВЛН()
 
#КонецОбласти

#Область Общее

// Ихсанов Д. А. Начало 16.06.2026 Изменение 0000000019 от 21.05.2026 13:00:05: e1cib/data/Документ.Изменение?ref=89690050568f680711f154fbd6fa2dc8
// Получить поля регистра сведений.
// 
// Параметры:
//  ИмяРегистраСведений - Строка - Имя регистра сведений
// 
// Возвращаемое значение:
//  Массив Из Строка - Получить поля регистра сведений
Функция ПолучитьПоляРегистраСведений(ИмяРегистраСведений) Экспорт
	
	Возврат ОбменМаркетПлейс.ПолучитьПоляРегистраСведений(ИмяРегистраСведений);
	
КонецФункции // ПолучитьПоляРегистра()
// Ихсанов Д. А. Конец 16.06.2026

#КонецОбласти

#КонецОбласти
